Repository: kahihia/YAAS
Catalog: locale/*/LC_MESSAGES/django.po
Languages: fi

source: English
fi: englanti

source: Finnish
fi: suomi

source: Username
fi: Käyttäjätunnus

source: Email
fi: Sähköpostiosoite

source: Password
fi: Salasana

source: Password again
fi: Salasana uudelleen

source: Enter date in form dd.mm.yyy hh:mm
fi: Syötä päivämäärä muodossa pp.kk.vvvv tt:mm

source: You must be logged in to use this feature.
fi: Sinun täytyy olla kirjautuneena sisään käyttääksesi tätä toimintoa

source: New passwords don't match
fi: Uudet salasanat eivät täsmää

source: New User is created. Please Login
fi: Uusi käyttäjä luotu. Kirjaudu sisään

source: New Auction has been saved
fi: Uusi huutokauppa tallennettu

source: Your requested auction is not Active!!
fi: Hakemasi huutokauppa ei ole aktiivinen!!

source: You can't edit an auction you're not selling.
fi: Et voi muokata muiden huutokauppaa.

source: Description edited
fi: Kuvaus muutettu

source: You can't bid on an auction you're selling.
fi: Et voi tarjota esineestä, jota myyt

source: You already have the highest bid, you can't bid higher!
fi: Sinulla on jo korkein tarjous, et voi tarjota enempää!

source: The seller has changed description. Please bid again.
fi: Myyjä on muuttanut kuvausta. Tee tarjous uudestaan.

source: You must have a . separator and no more than two decimals, example: '1.43'
fi: Syötä tarjous maksimissaan kahden desimaalin tarkkuudella ja käytä . erottimena

source: bid registered
fi: tarjous rekisteröity

source: The new bid must be at least 0.01 more than the current bid or minimum bid
fi: Uuden tarjouksen täytyy olla vähintään 0.01 suurempi kuin nykyinen tai minimitarjous

source: Currency changed to: {}
fi: Valuutta muutettu: {}

source: Yet Another Auction Site
fi: Taas Toinen Huutokauppa Sivu

source: Browse
fi: Selaa

source: Create Auction
fi: Luo Huutokauppa

source: Logout
fi: Kirjaudu Ulos

source: Log in
fi: Kirjaudu Sisään

source: Change Language
fi: Muuta Kieltä

source: Change Currency
fi: Muuta Valuuttaa

source: Bid
fi: Tarjoa

source: Description:
fi: Kuvaus:

source: Seller:
fi: Myyjä:

source: Minimum bid:
fi: Minimi tarjous:

source: Current bid
fi: Nykyinen tarjous

source: Auction deadline
fi: Huutokaupan takaraja

source: Please note that you are bidding in currency
fi: Huomaathan, että tarjoat valuutassa

source: Browse Auctions
fi: Selaa huutokauppoja

source: Search for auctions
fi: Etsi huutokauppoja

source: State:
fi: Tila:

source: Edit Description
fi: Muuta kuvausta

source: Ban
fi: Porttikiellä

source: Description
fi: Kuvaus

source: Seller
fi: Myyjä

source: Minimum bid
fi: Minimi tarjous

source: Auction closes
fi: Huutokauppa sulkeutuu

source: Prices shown in
fi: Hinnat näytetään valuutassa

source: Are you sure you want to add the Auction?
fi: Oletko varma, että haluat lisätä tämän huutokaupan

source: Title:
fi: Otsikko:

source: Yes
fi: Kyllä

source: No
fi: Ei

source: Create new Auction
fi: Luo uusi tarjous

source: Create
fi: Luo

source: Please note that you are using currency
fi: Huomaathan, että käytät valuuttaa

source: Edit auction
fi: Muuta kuvausta

source: Save
fi: Tallenna

source: Home Page
fi: Kotisivu

source: logged in as
fi: kirjautuneena sisään käyttäjänimellä

source: Login
fi: Kirjaudu sisään

source: Don't have an account?
fi: Eikö sinulla ole vielä tiliä?

source: Create here for free
fi: Luo tästä ilmaiseksi

source: Create user
fi: Luo käyttäjä

source: Register
fi: Rekisteröidy

source: 's profile
fi: :n profiili

source: Change Email
fi: Muuta sähköpostiosoitetta

source: Change Password
fi: Muuta salasana
